52n-sos-webapp/src/main/webapp/static/examples/sos_v20/requests_soap/Transactional/UpdateSensor.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sosInsertSensor.xsd
http://www.opengis.net/swes/2.0 http://schemas.opengis.net/swes/2.0/swes.xsd" xmlns:swes="http://www.opengis.net/swes/2.0" xmlns:sos="http://www.opengis.net/sos/2.0" xmlns:swe="http://www.opengis.net/swe/1.0.1" xmlns:sml="http://www.opengis.net/sensorML/1.0.1" xmlns:gml="http://www.opengis.net/gml" xmlns:xlink="http://www.w3.org/1999/xlink">
	<env:Body>
		<swes:UpdateSensorDescription service="SOS" version="2.0.0">
		<swes:procedure>http://www.my_namespace.org/sensors/100</swes:procedure>
		<swes:procedureDescriptionFormat>http://www.opengis.net/sensorML/1.0.1</swes:procedureDescriptionFormat>
		<swes:description>
			<swes:SensorDescription>
				<swes:data>
					<sml:SensorML version="1.0.1">
			          <sml:member>
			            <sml:System>
			              <sml:identification>
			                <sml:IdentifierList>
			                  <sml:identifier>
			                    <sml:Term definition="urn:ogc:def:identifier:OGC:uniqueID">
			                      <sml:value>http://www.my_namespace.org/sensors/100</sml:value>
			                    </sml:Term>
			                  </sml:identifier>
			                </sml:IdentifierList>
			              </sml:identification>
			              <sml:capabilities name="parentProcedures">
			                <swe:SimpleDataRecord>
			                  <gml:metaDataProperty xlink:title="http://www.my_namespace.org/sensors/1821241365" xlink:href="http://localhost:8080/52nSOSv4.0.0/kvp?request=DescribeSensor&amp;service=SOS&amp;version=2.0.0&amp;procedure=http://www.my_namespace.org/sensors/1821241365&amp;procedureDescriptionFormat=http%3A%2F%2Fwww.opengis.net%2FsensorML%2F1.0.1"/>
			                </swe:SimpleDataRecord>
			              </sml:capabilities>
			              <sml:position name="sensorPosition">
			                <swe:Position referenceFrame="urn:ogc:def:crs:EPSG::4326">
			                  <swe:location>
			                    <swe:Vector gml:id="STATION_LOCATION">
			                      <swe:coordinate name="easting">
			                        <swe:Quantity axisID="x">
			                          <swe:uom code="degree"/>
			                          <swe:value>7.727959</swe:value>
			                        </swe:Quantity>
			                      </swe:coordinate>
			                      <swe:coordinate name="northing">
			                        <swe:Quantity axisID="y">
			                          <swe:uom code="degree"/>
			                          <swe:value>51.8839064</swe:value>
			                        </swe:Quantity>
			                      </swe:coordinate>
			                      <swe:coordinate name="altitude">
			                        <swe:Quantity axisID="z">
			                          <swe:uom code="m"/>
			                          <swe:value>51.99</swe:value>
			                        </swe:Quantity>
			                      </swe:coordinate>
			                    </swe:Vector>
			                  </swe:location>
			                </swe:Position>
			              </sml:position>
			              <sml:inputs>
			                <sml:InputList>
			                  <sml:input name="">
			                    <swe:ObservableProperty definition="http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#Discharge"/>
			                  </sml:input>
			                </sml:InputList>
			              </sml:inputs>
			              <sml:outputs>
			                <sml:OutputList>
			                  <sml:output name="">
			                    <swe:Quantity definition="http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#Discharge">
			                      <swe:uom code="NOT_DEFINED"/>
			                    </swe:Quantity>
			                  </sml:output>
			                </sml:OutputList>
			              </sml:outputs>
			              <components>
			                <ComponentList>
			                  <component name="component1" xlink:title="http://www.my_namespace.org/sensors/676398562">
			                    <sml:System>
			                      <sml:identification>
			                        <sml:IdentifierList>
			                          <sml:identifier>
			                            <sml:Term definition="urn:ogc:def:identifier:OGC:uniqueID">
			                              <sml:value>http://www.my_namespace.org/sensors/676398562</sml:value>
			                            </sml:Term>
			                          </sml:identifier>
			                        </sml:IdentifierList>
			                      </sml:identification>
			                      <sml:position name="sensorPosition">
			                        <swe:Position referenceFrame="urn:ogc:def:crs:EPSG::4326">
			                          <swe:location>
			                            <swe:Vector gml:id="STATION_LOCATION_2">
			                              <swe:coordinate name="easting">
			                                <swe:Quantity axisID="x">
			                                  <swe:uom code="degree"/>
			                                  <swe:value>7.727958</swe:value>
			                                </swe:Quantity>
			                              </swe:coordinate>
			                              <swe:coordinate name="northing">
			                                <swe:Quantity axisID="y">
			                                  <swe:uom code="degree"/>
			                                  <swe:value>51.883906</swe:value>
			                                </swe:Quantity>
			                              </swe:coordinate>
			                              <swe:coordinate name="altitude">
			                                <swe:Quantity axisID="z">
			                                  <swe:uom code="m"/>
			                                  <swe:value>52.0</swe:value>
			                                </swe:Quantity>
			                              </swe:coordinate>
			                            </swe:Vector>
			                          </swe:location>
			                        </swe:Position>
			                      </sml:position>
			                      <sml:inputs>
			                        <sml:InputList>
			                          <sml:input name="">
			                            <swe:ObservableProperty definition="http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#Discharge"/>
			                          </sml:input>
			                        </sml:InputList>
			                      </sml:inputs>
			                      <sml:outputs>
			                        <sml:OutputList>
			                          <sml:output name="">
			                            <swe:Quantity definition="http://sweet.jpl.nasa.gov/2.0/hydroSurface.owl#Discharge">
			                              <swe:uom code="NOT_DEFINED"/>
			                            </swe:Quantity>
			                          </sml:output>
			                        </sml:OutputList>
			                      </sml:outputs>
			                    </sml:System>
			                  </component>
			                </ComponentList>
			              </components>
			            </sml:System>
			          </sml:member>
			        </sml:SensorML>
				</swes:data>
			</swes:SensorDescription>
		</swes:description>
	</swes:UpdateSensorDescription>
	</env:Body>
</env:Envelope>